---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid1Offset
source: html/66e6adc1-452c-a9c6-1489-9092f62455aa.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid1Offset Property

The offset for the U grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public double Grid1Offset { get; set; }
```